# Occupation

### Introduction:


### Step 1. Import the necessary libraries

In [110]:
import pandas as pd

### Step 2. Import the dataset from this [address](https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user).

In [111]:
address=("https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user")

### Step 3. Assign it to a variable called users.

In [112]:
users=pd.read_csv("https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user", sep= "|")
users

     user_id  age gender     occupation zip_code
0          1   24      M     technician    85711
1          2   53      F          other    94043
2          3   23      M         writer    32067
3          4   24      M     technician    43537
4          5   33      F          other    15213
..       ...  ...    ...            ...      ...
938      939   26      F        student    33319
939      940   32      M  administrator    02215
940      941   20      M        student    97229
941      942   48      F      librarian    78209
942      943   22      M        student    77841

[943 rows x 5 columns]

In [113]:
users=pd.read_csv("https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user", sep="|",index_col="user_id")
users

         age gender     occupation zip_code
user_id
1         24      M     technician    85711
2         53      F          other    94043
3         23      M         writer    32067
4         24      M     technician    43537
5         33      F          other    15213
...      ...    ...            ...      ...
939       26      F        student    33319
940       32      M  administrator    02215
941       20      M        student    97229
942       48      F      librarian    78209
943       22      M        student    77841

[943 rows x 4 columns]

### Step 4. Discover what is the mean age per occupation

In [114]:
users.groupby("occupation").age.mean()

occupation
administrator    38.746835
artist           31.392857
doctor           43.571429
educator         42.010526
engineer         36.388060
entertainment    29.222222
executive        38.718750
healthcare       41.562500
homemaker        32.571429
lawyer           36.750000
librarian        40.000000
marketing        37.615385
none             26.555556
other            34.523810
programmer       33.121212
retired          63.071429
salesman         35.666667
scientist        35.548387
student          22.081633
technician       33.148148
writer           36.311111
Name: age, dtype: float64

### Step 5. Discover the Male ratio per occupation and sort it from the most to the least

In [115]:
df= users.copy()
df

         age gender     occupation zip_code
user_id
1         24      M     technician    85711
2         53      F          other    94043
3         23      M         writer    32067
4         24      M     technician    43537
5         33      F          other    15213
...      ...    ...            ...      ...
939       26      F        student    33319
940       32      M  administrator    02215
941       20      M        student    97229
942       48      F      librarian    78209
943       22      M        student    77841

[943 rows x 4 columns]

In [116]:
df.groupby("gender").count()

        age  occupation  zip_code
gender
F       273         273       273
M       670         670       670

In [117]:
def gender_to_numeric(x):
    if x == "M":
        return 1
    if x =="F":
        return 0

users["nueva_col"]=users["gender"].apply(gender_to_numeric)
users

         age gender     occupation zip_code  nueva_col
user_id
1         24      M     technician    85711          1
2         53      F          other    94043          0
3         23      M         writer    32067          1
4         24      M     technician    43537          1
5         33      F          other    15213          0
...      ...    ...            ...      ...        ...
939       26      F        student    33319          0
940       32      M  administrator    02215          1
941       20      M        student    97229          1
942       48      F      librarian    78209          0
943       22      M        student    77841          1

[943 rows x 5 columns]

In [118]:
users.groupby("occupation").nueva_col.sum()

occupation
administrator     43
artist            15
doctor             7
educator          69
engineer          65
entertainment     16
executive         29
healthcare         5
homemaker          1
lawyer            10
librarian         22
marketing         16
none               5
other             69
programmer        60
retired           13
salesman           9
scientist         28
student          136
technician        26
writer            26
Name: nueva_col, dtype: int64

In [119]:
users.occupation.value_counts()

student          196
other            105
educator          95
administrator     79
engineer          67
programmer        66
librarian         51
writer            45
executive         32
scientist         31
artist            28
technician        27
marketing         26
entertainment     18
healthcare        16
retired           14
salesman          12
lawyer            12
none               9
doctor             7
homemaker          7
Name: occupation, dtype: int64

In [120]:
a = (users.groupby('occupation').nueva_col.sum() / users.occupation.value_counts()) * 100 
# sort to the most male 
a = a.sort_values(ascending = False).round(2)
a.astype(str) + "%"

doctor           100.0%
engineer         97.01%
technician        96.3%
retired          92.86%
programmer       90.91%
executive        90.62%
scientist        90.32%
entertainment    88.89%
lawyer           83.33%
salesman          75.0%
educator         72.63%
student          69.39%
other            65.71%
marketing        61.54%
writer           57.78%
none             55.56%
administrator    54.43%
artist           53.57%
librarian        43.14%
healthcare       31.25%
homemaker        14.29%
dtype: object

### Step 6. For each occupation, calculate the minimum and maximum ages

In [121]:
users

         age gender     occupation zip_code  nueva_col
user_id
1         24      M     technician    85711          1
2         53      F          other    94043          0
3         23      M         writer    32067          1
4         24      M     technician    43537          1
5         33      F          other    15213          0
...      ...    ...            ...      ...        ...
939       26      F        student    33319          0
940       32      M  administrator    02215          1
941       20      M        student    97229          1
942       48      F      librarian    78209          0
943       22      M        student    77841          1

[943 rows x 5 columns]

In [122]:
users.groupby("occupation").age.agg(["min","max"])

               min  max
occupation
administrator   21   70
artist          19   48
doctor          28   64
educator        23   63
engineer        22   70
entertainment   15   50
executive       22   69
healthcare      22   62
homemaker       20   50
lawyer          21   53
librarian       23   69
marketing       24   55
none            11   55
other           13   64
programmer      20   63
retired         51   73
salesman        18   66
scientist       23   55
student          7   42
technician      21   55
writer          18   60

### Step 7. For each combination of occupation and gender, calculate the mean age

In [123]:
users.groupby(["occupation","gender"]).mean().loc[:,:"age"]

                            age
occupation    gender
administrator F       40.638889
              M       37.162791
artist        F       30.307692
              M       32.333333
doctor        M       43.571429
educator      F       39.115385
              M       43.101449
engineer      F       29.500000
              M       36.600000
entertainment F       31.000000
              M       29.000000
executive     F       44.000000
              M       38.172414
healthcare    F       39.818182
              M       45.400000
homemaker     F       34.166667
              M       23.000000
lawyer        F       39.500000
              M       36.200000
librarian     F       40.000000
              M       40.000000
marketing     F       37.200000
              M       37.875000
none          F       36.500000
              M       18.600000
other         F       35.472222
              M       34.028986
programmer    F       32.166667
              M       33.216667
retired       F       70.000000
              M       62.538462
salesman      F       27.000000
              M       38.555556
scientist     F       28.333333
              M       36.321429
student       F       20.750000
              M       22.669118
technician    F       38.000000
              M       32.961538
writer        F       37.631579
              M       35.346154

In [124]:
users.groupby(["occupation","gender"]).age.mean()

occupation     gender
administrator  F         40.638889
               M         37.162791
artist         F         30.307692
               M         32.333333
doctor         M         43.571429
educator       F         39.115385
               M         43.101449
engineer       F         29.500000
               M         36.600000
entertainment  F         31.000000
               M         29.000000
executive      F         44.000000
               M         38.172414
healthcare     F         39.818182
               M         45.400000
homemaker      F         34.166667
               M         23.000000
lawyer         F         39.500000
               M         36.200000
librarian      F         40.000000
               M         40.000000
marketing      F         37.200000
               M         37.875000
none           F         36.500000
               M         18.600000
other          F         35.472222
               M         34.028986
programmer     F         32.166667
               M         33.216667
retired        F         70.000000
               M         62.538462
salesman       F         27.000000
               M         38.555556
scientist      F         28.333333
               M         36.321429
student        F         20.750000
               M         22.669118
technician     F         38.000000
               M         32.961538
writer         F         37.631579
               M         35.346154
Name: age, dtype: float64

### Step 8.  For each occupation present the percentage of women and men

In [125]:
s=pd.pivot_table(data=users, values="age", index="occupation", columns="gender", aggfunc="count")
s

gender            F      M
occupation
administrator  36.0   43.0
artist         13.0   15.0
doctor          NaN    7.0
educator       26.0   69.0
engineer        2.0   65.0
entertainment   2.0   16.0
executive       3.0   29.0
healthcare     11.0    5.0
homemaker       6.0    1.0
lawyer          2.0   10.0
librarian      29.0   22.0
marketing      10.0   16.0
none            4.0    5.0
other          36.0   69.0
programmer      6.0   60.0
retired         1.0   13.0
salesman        3.0    9.0
scientist       3.0   28.0
student        60.0  136.0
technician      1.0   26.0
writer         19.0   26.0

In [126]:
s = s.fillna(0)
s

gender            F      M
occupation
administrator  36.0   43.0
artist         13.0   15.0
doctor          0.0    7.0
educator       26.0   69.0
engineer        2.0   65.0
entertainment   2.0   16.0
executive       3.0   29.0
healthcare     11.0    5.0
homemaker       6.0    1.0
lawyer          2.0   10.0
librarian      29.0   22.0
marketing      10.0   16.0
none            4.0    5.0
other          36.0   69.0
programmer      6.0   60.0
retired         1.0   13.0
salesman        3.0    9.0
scientist       3.0   28.0
student        60.0  136.0
technician      1.0   26.0
writer         19.0   26.0

In [127]:
s["Total"]= s["M"]+ s["F"]
s

gender            F      M  Total
occupation
administrator  36.0   43.0   79.0
artist         13.0   15.0   28.0
doctor          0.0    7.0    7.0
educator       26.0   69.0   95.0
engineer        2.0   65.0   67.0
entertainment   2.0   16.0   18.0
executive       3.0   29.0   32.0
healthcare     11.0    5.0   16.0
homemaker       6.0    1.0    7.0
lawyer          2.0   10.0   12.0
librarian      29.0   22.0   51.0
marketing      10.0   16.0   26.0
none            4.0    5.0    9.0
other          36.0   69.0  105.0
programmer      6.0   60.0   66.0
retired         1.0   13.0   14.0
salesman        3.0    9.0   12.0
scientist       3.0   28.0   31.0
student        60.0  136.0  196.0
technician      1.0   26.0   27.0
writer         19.0   26.0   45.0

In [128]:
s["F"]=round(((s["F"]/s["Total"])*100),2).astype(str)+"%"
s["M"]=round(((s["M"]/s["Total"])*100),2).astype(str)+"%"
s

gender              F       M  Total
occupation
administrator  45.57%  54.43%   79.0
artist         46.43%  53.57%   28.0
doctor           0.0%  100.0%    7.0
educator       27.37%  72.63%   95.0
engineer        2.99%  97.01%   67.0
entertainment  11.11%  88.89%   18.0
executive       9.38%  90.62%   32.0
healthcare     68.75%  31.25%   16.0
homemaker      85.71%  14.29%    7.0
lawyer         16.67%  83.33%   12.0
librarian      56.86%  43.14%   51.0
marketing      38.46%  61.54%   26.0
none           44.44%  55.56%    9.0
other          34.29%  65.71%  105.0
programmer      9.09%  90.91%   66.0
retired         7.14%  92.86%   14.0
salesman        25.0%   75.0%   12.0
scientist       9.68%  90.32%   31.0
student        30.61%  69.39%  196.0
technician       3.7%   96.3%   27.0
writer         42.22%  57.78%   45.0

In [129]:
s.drop("Total",axis=1, inplace=True)
s

gender              F       M
occupation
administrator  45.57%  54.43%
artist         46.43%  53.57%
doctor           0.0%  100.0%
educator       27.37%  72.63%
engineer        2.99%  97.01%
entertainment  11.11%  88.89%
executive       9.38%  90.62%
healthcare     68.75%  31.25%
homemaker      85.71%  14.29%
lawyer         16.67%  83.33%
librarian      56.86%  43.14%
marketing      38.46%  61.54%
none           44.44%  55.56%
other          34.29%  65.71%
programmer      9.09%  90.91%
retired         7.14%  92.86%
salesman        25.0%   75.0%
scientist       9.68%  90.32%
student        30.61%  69.39%
technician       3.7%   96.3%
writer         42.22%  57.78%